import Foundation

class Plug {
    
    static var plugWorkoutImage = "4"
    static var plugDescription1 =
                    """
                    Это у нас почему в прошлую среду всегда два упражнения было? Потому что мы на понедельник копили 😈
                    
                    1. Разминка:
                    
                    а) МФР + 5' кардио (до тренировки)
                    б) 2х:
                    
                    10/10 ракушек
                    10/10 о/ногих ягодичных мостов
                    10 приседаний с блином 15/10 кг. за головой
                    
                    2. Сила:
                    
                    Е2/12'
                    
                    2 приседания со штангой на спине
                    
                    3. Работоспособность:
                    
                    36 бросков медбола
                    36 ситапов с медболом 9/6
                    18 бёрпи с боковым перепрыгиванием слэмбола
                    36 взятий слэмбола 40/30 на плечо
                    18 бёрпи с боковым перепрыгиванием слэмбола
                    36 ситапов с медболом 9/6
                    36 бросков медбола
                    
                    cap: 18'
                    
                    4. Заминка:
                    
                    а) 3х:
                    
                    15-25 лицевых тяг с резиной
                    30-40''/30-40'' боковая планка
                    
                    б) стретчинг
                    """
    static var plugDescription2 = """
        После жестких заданий понедельника и среды оставили для вас на пятницу простые человеческие движения. И барьеры 😅

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) 4х:

        15'' superman
        5'' отдых
        15'' hollow
        5'' отдых

        2. Ф.кач:

        Е3/12'

        10 тяг штанги в наклоне
        20-25 V-апов

        3. Работоспособность:

        5х:

        12 выпадов ОХ с блином 15/10
        24 касаний плеч в упоре на блине

        36 барьеров 75/60 см.

        5х:

        12 выпадов ОХ с блином 15/10
        24 касаний плеч в упоре на блине

        cap: 18'

        4. Заминка:

        а) 3х:

        10-11/10-11 жимов гантели лёжа на полу
        15-17/15-17 о/ногих ягодичных мостов с гантелей на полу

        б) стретчинг
        """
    
    static var plugDescription3 = """
        У нас сегодня тренировка с повышенным количеством core-содержащих упражнений 😉

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) суставная

        2. Работоспособность:

        4-5х:

        AMRAP 2'

        8/6 калорий assault bike
        12 landmine-вращений со штангой

        отдых 2'

        AMRAP 2'

        4 челнока кубковой переноски гири
        40 скалолазов без постановки ног

        отдых 2'

        4. Заминка:

        а) стретчинг
        """
    static var plugDescription4 = """
        В комплексе сегодня всего два движения. Значит будет плотно и потно! 🔥

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) 2х:

        20 касаний плеч в упоре лёжа
        10 подъёмов медбола 4/3 перед собой
        30 ОП на скакалке

        2. Техника

        Чередуя 1,5/15'

        а) 3-7.3-7 отжиманий кипом в стойке на руках
        б) 45'' практика ДП (не больше 60)

        3. Работоспособность:

        11 челноков бега
        22 тяги гири 32/24 сумо с протяжкой
        22 челноков бега
        44 тяги гири 32/24 сумо с протяжкой
        33 челнока бега
        66 тяг гири 32/24 сумо с протяжкой

        cap: 16'

        4. Заминка:

        а) 3х:

        10-12 обратных снежных ангелов
        1'-1'15'' вис на турнике

        б) стретчинг
        """
    static var plugDescription5 = """
        Укрепляем кор сегодня не только в силовой части, но и в кондиционной!

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) суставная

        2. Ф. гипертрофия:

        Е3/12

        10-12 роллаутов с коленей
        15/15 сгибаний ноги с резиной лёжа

        3. Работоспособность:

        Чередуя минуты 24'

        а) гребля или c2 bike
        б) отдых
        в) поочерёдные турецкие подъёмы с гантелей 15/10
        г) отдых

        4. Заминка:

        а) стретчинг
        """
    static var plugDescription6 = """
        Режим приседаний сегодня добрее, а значит, ждём штанги потяжелее! (да, в рифму 😉)

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) 2х:

        12/12 пожарных гидрантов
        12 ягодичных мостов
        6 воздушных приседаний с выпрыгиванием

        2. Сила:

        Е3/15'

        2.2 приседания со штангой на спине

        3. Работоспособность:

        AMRAP 15'

        16/14 НКП
        2х:
        8/8 швунгов гантели 22,5/15
        12 перепрыгиваний короба 60/50 см.

        4. Заминка:

        а) 3х:

        15-20 лицевых тяг с резиной
        30-35''/30-35'' боковая планка

        б) стретчинг
        """
    static var plugDescription7 = """
        Заканчиваем тренировочную неделю интервалами из фронтальных приседаний и отжиманий от пола!

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) 2х:

        8/8 тяг ренегата с гантелей
        24 русских скручиваний без веса

        2. Ф.кач:

        Е2,5/12,5

        8 тяг штанги в наклоне
        15-20 V-апов

        3. Работоспособность:

        2,5:2,5/20'

        15 фронтальных приседаний 50/35 кг.
        75 русских скручиваний с медболом 9/6 кг.
        до конца: максимум отжиманий от пола с отрывом рук

        4. Заминка:

        а) 3х:

        10/10 жимов гантели лёжа на полу
        15/15 о/ногих ягодичных мостов с гантелей на полу

        б) стретчинг
        """
    static var plugDescription8 = """
        В сегодняшнем ЕМОМ'е четверга всего четыре (да, мы считаем отдых) станции. А значит, заходить на каждую придётся чаще. Приготовьтесь к серьёзному объёму движений!

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) суставная

        2. Работоспособность:

        Чередуя минуты 32-40'

        а) 1-3 подъёма по канату
        б) 2-4 челнока переноски мешка 50-70/30-40 медвежьим хватом
        в) 40'' лыжи или байк руками
        г) отдых

        4. Заминка:

        а) стретчинг
        """
    static var plugDescription9 = """
        Ближайшие три недели будем учить/улучшать/подводиться к такому упражнению, как отжимания в стойке на руках кипом!

        Ну и немного двойных прыжков на сладкое 😉

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) 2х:

        4 гусеницы
        8 обратных снежных ангелов
        24 ОП на скакалке

        2. Техника

        Чередуя минуты 12'

        а) 4-10 отжиманий кипом в стойке
        б) 30'' практика ДП (не больше 40)

        3. Работоспособность:

        48 перешагиваний короба с гантелей 22,5/15 кг.
        24 о/руких дьявольских жимов с гантелей 22,5/15 кг.
        96 ситапов с медболом 9/6 кг.
        24 о/руких дьявольских жимов с гантелей 22,5/15 кг.
        48 перешагиваний короба с гантелей 22,5/15 кг.

        cap: 18'

        4. Заминка:

        а) 3х:

        10 обратных снежных ангелов
        1' вис на турнике

        б) стретчинг
        """
    static var plugDescription10 = """
        Приготовили для вас тренировку с эргометрами на сегодня!

        1. Разминка:

        а) МФР + 5' кардио (до тренировки)
        б) суставная

        2. Ф. гипертрофия:

        Е3/9

        10-12 роллаутов с коленей
        15/15 сгибаний ноги с резиной лёжа

        3. Работоспособность:

        Чередуя 2'/30'

        а) 20-24/16-18 калорий гребля
        б) 18-20/14-15 калорий лыжи или 10/8 калорий assault bike руками
        в) 16/12 калорий c2 bike

        *каждый интервал - не дольше 1'15''

        4. Заминка:

        а) стретчинг
        """
    
    static var arrayplugDescription = [plugDescription1, plugDescription2, plugDescription3, plugDescription4, plugDescription5, plugDescription6, plugDescription7, plugDescription8, plugDescription9, plugDescription10]
}
